export interface QuestionProps {
    id: number,
    title: string
    variants: string[]
    correct: number
}

export const questions: QuestionProps[] = [
    {
        id: 1,
        title: 'Що таке JSX?',
        variants: ['JavaScript XML', 'JavaScript Extension', 'JavaScript Syntax eXtension'],
        correct: 0
    },
    {
        id: 2,
        title: 'Який хук React використовується для додавання стану у функціональний компонент?',
        variants: ['useEffect', 'useState', 'useReducer'],
        correct: 1
    },
    {
        id: 3,
        title: 'Що таке props у React?',
        variants: ['Це функція для передачі даних між компонентами', 'Це вбудований об\'єкт для доступу до властивостей компонента', 'Це спеціальна властивість для визначення типу компонента'],
        correct: 1
    },
    {
        id: 4,
        title: 'Що таке контекст (context) у React і для чого він використовується?',
        variants: ['Контекст використовується для визначення області видимості змінних у компоненті', 'Контекст надає спосіб передачі даних через дерево компонентів без необхідності передавати пропси на проміжних рівнях', 'Контекст використовується для стилізації компонентів'],
        correct: 1
    },
    {
        id: 5,
        title: 'Що таке virtual DOM і для чого він використовується у React?',
        variants: ['Це віртуальне представлення реального DOM, яке дозволяє React оптимізувати процес оновлення реального DOM', 'Це DOM, який використовується у тестуванні застосунків на React', 'Це спеціальний DOM для візуалізації даних у React'],
        correct: 0
    },
    {
        id: 6,
        title: 'Які переваги має використання React?',
        variants: ['Простота у вивченні та використанні', 'Ефективна оптимізація застосунку', 'Швидка розробка'],
        correct: 2
    },
    {
        id: 7,
        title: 'Що таке компонент вищого порядку (HOC) у React?',
        variants: ['Це функція, яка приймає компонент і повертає новий компонент', 'Це метод для створення анімацій у React', 'Це спеціальний компонент для стилізації інших компонентів'],
        correct: 0
    },
    {
        id: 8,
        title: 'Що таке синтаксис розгортання (spread syntax) у JavaScript і як він використовується у React?',
        variants: ['Це спеціальний синтаксис для створення масивів', 'Це спеціальний синтаксис для передачі пропсів у компоненти React', 'Це спеціальний синтаксис для створення нового об\'єкта на основі існуючого об\'єкта'],
        correct: 2
    },
    {
        id: 9,
        title: 'Що таке React Router?',
        variants: ['Бібліотека для додавання анімацій у React', 'Бібліотека для додавання маршрутизації у React-застосунки', 'Бібліотека для роботи з HTTP-запитами у React'],
        correct: 1
    },
    {
        id: 10,
        title: 'Що таке життєвий цикл компонента у React?',
        variants: ['Це послідовність етапів, через які проходить компонент від створення до видалення', 'Це здатність компонента змінювати свій стан протягом життя застосунку', 'Це здатність компонента автоматично оновлюватися при зміні даних'],
        correct: 0
    }
]
